<?php
$link = @mysqli_connect("localhost", "root", "abc456")
 				or die(mysqli_connect_error());
				
//ถ้ายังไม่มีฐานข้อมูลให้สร้างขึ้นมาใหม่
$sql = "CREATE DATABASE IF NOT EXISTS pmj";
mysqli_query($link, $sql);
mysqli_select_db($link, "pmj");

//ถ้ายังไม่มีตารางให้สร้างขึ้นใหม่
$sql = "CREATE TABLE IF NOT EXISTS shopping_cart(
			item_id  SMALLINT UNSIGNED PRIMARY KEY AUTO_INCREMENT,
			name  VARCHAR(200),
			detail TEXT,
			color VARCHAR(150),
			price MEDIUMINT UNSIGNED, 
			image VARCHAR(250))";
			
mysqli_query($link, $sql);
			
$sql = "SELECT COUNT(*) FROM shopping_cart";
$rs = mysqli_query($link, $sql);
$data = mysqli_fetch_array($rs);
if($data[0] == 0) {
	$sql = "REPLACE INTO shopping_cart VALUES
	
		 		('', 'เสื้อ', 'เสื้อ ใช้ในการห่อหุ้มร่ายกายท่อนบน เสื้อเป็นองค์ประกอบอย่างหนึ่งของเครื่องนุ่งห่ม ซึ่งเป็นหนึ่งในปัจจัย 4 ของมนุษย์ ทั้งนี้เราจะแบ่งเสื้อออกเป็นขนาดต่างๆกัน เช่น S, M, L เป็นต้น ดังนั้นหากจะซื้อเสื้อ ต้องเลือกขนาดให้เหมาะสมกับผู้สวมใส่', 'ขาว, ดำ, ฟ้า', '500', 'shirt1.jpg, shirt2.jpg'),
				
				('', 'กางเกง', 'กางเกง ใช้ในการห่อหุ้มร่ายกายท่อนล่าง มีทั้งแบบขาสั้นและขายาว ขนาดของกางเกงเราจะพิจารณาจากรอบเอว ดังนั้นก่อนจะซื้อกางเกง  เราต้องรู้ขนาดรอบเอวของผู้สวมใส่', 'ขาว, ดำ, เทา', '800', 'trouser1.jpg, trouser2.jpg'),
				
				('', 'หมวก', 'หมวก ใช้สำหรับสวมใส่ลงบนศีรษะ เพื่อป้องกัน แสงแดด ฝน หรือเพื่อสวยงาม  หมวกมีหลายแบบและทำจากวัสดุต่างชนิดกัน ดังนั้นหากจะซื้อหมวก เราต้องคำนึงถึงวัตถุประสงค์ของการใช้งานเป็นหลัก', 'ขาว, ฟ้า, ดำ', '200', 'cap1.jpg, cap2.jpg, cap3.jpg'),
				
				('', 'รองเท้า', 'รองเท้า ใชสำหรับสวมใส่ที่เท้า เพื่อป้องกันอันตรายต่างๆที่จะเกิดขึ้นกับเท้า โดยรองเท้านั้นมีหลายประเภท เช่น รองเท้าแตะ รองเท้าผ้าใบ รองเท้าส้นสูง รองเท้ากีฬา  เป็นต้น ซึ่งรองเท้าแต่ละแบบก็จะเหมาะกับการใช้งานเฉพาะอย่าง ดังนั้นต้องเลือกเลือกซื้อรองเท้าให้ตรงกับลักษณะการใช้งาน', 'ดำ, น้ำตาล, ขาว', '1000', 'shoe1.jpg, shoe2.jpg, shoe3.jpg'),
				
				('', 'กระเป๋า', 'กระเป๋า ใช้สำหรับใส่สิ่งของ เอกสาร หรืออื่นๆ จะถือก็ได้ สะพายก็ดี กระเป๋ามีหลากหลายขนาดและสีสันให้เลือกตามความชอบของแต่ละบุคคล', 'ดำ, น้ำตาล', '1500', 'bag1.jpg, bag2.jpg, bag3.jpg')";
				
}
mysqli_query($link, $sql);

mysqli_close($link);
?>