<?php
$names = array(1=>"เสื้อ", "กางเกง", "หมวก", "รองเท้า", "กระเป๋า");
$details = array(
				1=>"เสื้อ ใช้ในการห่อหุ้มร่ายกายท่อนบน เสื้อเป็นองค์ประกอบอย่างหนึ่งของเครื่องนุ่งห่ม ซึ่งเป็นหนึ่งในปัจจัย 4 ของมนุษย์ ทั้งนี้เราจะแบ่งเสื้อออกเป็นขนาดต่างๆกัน เช่น S, M, L เป็นต้น ดังนั้นหากจะซื้อเสื้อ ต้องเลือกขนาดให้เหมาะสมกับผู้สวมใส่",
				"กางเกง ใช้ในการห่อหุ้มร่ายกายท่อนล่าง มีทั้งแบบขาสั้นและขายาว ขนาดของกางเกงเราจะพิจารณาจากรอบเอว ดังนั้นก่อนจะซื้อกางเกง  เราต้องรู้ขนาดรอบเอวของผู้สวมใส่",
				"หมวก ใช้สำหรับสวมใส่ลงบนศีรษะ เพื่อป้องกัน แสงแดด ฝน หรือเพื่อสวยงาม  หมวกมีหลายแบบและทำจากวัสดุต่างชนิดกัน ดังนั้นหากจะซื้อหมวก เราต้องคำนึงถึงวัตถุประสงค์ของการใช้งานเป็นหลัก",
				"รองเท้า ใช้สำหรับสวมใส่ที่เท้า เพื่อป้องกันอันตรายต่างๆที่จะเกิดขึ้นกับเท้า โดยรองเท้านั้นมีหลายประเภท เช่น รองเท้าแตะ รองเท้าผ้าใบ รองเท้าส้นสูง รองเท้ากีฬา  เป็นต้น ซึ่งรองเท้าแต่ละแบบก็จะเหมาะกับการใช้งานเฉพาะอย่าง ดังนั้นต้องเลือกเลือกซื้อรองเท้าให้ตรงกับลักษณะการใช้งาน",
				"กระเป๋า ใช้สำหรับใส่สิ่งของ เอกสาร หรืออื่นๆ จะถือก็ได้ สะพายก็ดี กระเป๋ามีหลากหลายขนาดและสีสันให้เลือกตามความชอบของแต่ละบุคคล"
				);
$colors = array(1=>"ขาว, ดำ, ฟ้า", "ขาว, ดำ, เทา", "ขาว, ฟ้า, ดำ", "ดำ, น้ำตาล, ขาว", "ดำ, น้ำตาล");
$prices = array(1=>500, 800, 200, 1000, 1500);
$images = array(
					1=>array("shirt1.jpg", "shirt2.jpg"),
					array("trouser1.jpg", "trouser2.jpg"),
					array("cap1.jpg", "cap2.jpg", "cap3.jpg"),
					array("shoe1.jpg", "shoe2.jpg", "shoe3.jpg"),
					array("bag1.jpg", "bag2.jpg", "bag3.jpg")
				);
?>