<?php
	session_start();
	$a = array();
	
	 //ถ้ามีข้อมูลข้อมูลเดิมเก็บอยู่ในเซสชั่นอยู่แล้ว ให้นำข้อมูลนั้นมาใช้อีก
	if(isset($_SESSION['cart'])) {
		$a = $_SESSION['cart'];
	}

	$id = $_POST['id'];
	$q = $_POST['q']; 

	$b = array($id=>$q);   //ถ้าหยิบสินค้า#1 จำนวนเป็น 3 ชิ้นลักษณะที่ได้เช่น 'p1'=>'3'
	
	$a = array_merge($a, $b);   //ผนวกข้อมูลเดิม(กรณีมีในเซสชั่น)กับข้อมูลใหม่เข้าด้วยกัน

	$js = json_encode($a);
	echo $js;

	$_SESSION['cart'] = $a;   //เก็บข้อมูลในเซสชั่น เผื่อมีการหยิบสินค้าครั้งต่อไปก็นำข้อมูลนี้มาใช้อีก
?>